//#include <REGX52.H>

//void Wheel()
//{
//	
//	//停下，左转
//	ENA = 0;
//	ENA2 = 0;
//	ENB = 0;
//	ENB2 = 0;
//			
//	IN3 = 1;
//	IN32 = 1;
//	IN4 = 0;
//	IN42 = 0;	
//	time = 0;
//	delay(1000);
//	
//	//停下，直行	
//	ENA = 0;
//	ENA2 = 0;
//	ENB = 0;
//	ENB2 = 0;		
//	
//	IN1 = 0;
//	IN12 = 0;
//	IN2 = 1;
//	IN22 = 1;
//	IN3 = 0;
//	IN32 = 0;
//	IN4 = 1;
//	IN42 = 1
//	delay(1000);
//	
//	//停下，右转
//	ENA = 0;
//	ENA2 = 0;
//	ENB = 0;
//	ENB2 = 0;
//	
//	IN1 = 1;
//	IN12 = 1;	
//	IN2 = 0;
//	IN22 = 0;
//	
//	IN3 = 0;
//	IN32 = 0;
//	IN4 = 1;
//	IN42 = 1;
//	time = 0;
//	delay(2000);
//		
//	//停下，直行	
//	ENA = 0;
//	ENA2 = 0;
//	ENB = 0;
//	ENB2 = 0;		
//	
//	IN1 = 0;
//	IN12 = 0;
//	IN2 = 1;
//	IN22 = 1;
//	IN3 = 0;	
//	IN32 = 0;
//	IN4 = 1;
//	IN42 = 1
//	delay(1000);
//	
//	//停下，左转
//	ENA = 0;
//	ENA2 = 0;
//	ENB = 0;
//	ENB2 = 0;
//	
//	IN3 = 1;
//	IN32 = 1;
//	IN4 = 0;
//	IN42 = 0;
//	time = 0;
//	delay(1000)
//	
//	//停下，直行	
//	ENA = 0;
//	ENA2 = 0;
//	ENB = 0;
//	ENB2 = 0;		
//	
//	IN1 = 0;
//	IN12 = 0;
//	IN2 = 1;	
//	IN22 = 1;
//	IN3 = 0;
//	IN32 = 0;
//	IN4 = 1;
//	IN42 = 1
//}